Catalogs/__Изображения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>__Изображения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексКартинки</Name>
					<Comment>Индекс иконки, соответствующей расширению файла, для показа в списке</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>URL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/__Изображения/Ext/ObjectModule.bsl
Процедура ПриКопировании(ОбъектКопирования)

	// Некопируемые реквизиты.
	Если Не ЭтоГруппа Тогда
		Изображение = Неопределено;
		Идентификатор = Неопределено;
		Файл = Неопределено;
		URL = Неопределено;
	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()

Процедура ПередЗаписью(Отказ)

	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоГруппа Тогда
		
		// Проверка.
		Картинка = Изображение.Получить();
		Если (Картинка = Неопределено) Тогда
			Отказ = Истина;
			// TODO
		КонецЕсли;
		Если Не Отказ Тогда
			Картинка = Новый Картинка(Картинка);
			Если (Картинка.Формат() = ФорматКартинки.НеизвестныйФормат) Тогда
				Отказ = Истина;
				// TODO
			КонецЕсли;
		КонецЕсли;
		
		Если Не Отказ Тогда
			
			// Идентификатор и URL.
			РегистрыСведений.__НастройкиВебСервиса.РесурсПублицкацииИзображениеСгенерироватьURL(ЭтотОбъект);
		
			// Индекс картинки.
			ИндексКартинки = __РаботаСФайламиКлиентСервер.ПолучитьИндексПиктограммыФайла(__РаботаСФайламиКлиентСервер.ПолучитьРасширениеФайла(Файл)) + Число(ПометкаУдаления);
		
		КонецЕсли;
		
	Иначе
		
		// Индекс картинки.
		ИндексКартинки = __РаботаСДиалогамиКлиентСервер.ПолучитьИндексПиктограммыСправочника(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ)
	
	// При обмене данными опубликовать данные необходимо.
	Если Не ЭтоГруппа Тогда
		РегистрыСведений.__НастройкиВебСервиса.РесурсПублицкацииИзображениеРазместить(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры // ПриЗаписи()
